// Розробити dll-біліотеку, яка дозволяє працювати з класом Точка (у трьохвимірному просторі).
// Передбачити методи та властивості які дозволяють реалізувати: створення (ініціалізацію) точки,
// отримання відомостей про координати точки, відстань від даної точки до точки початку координат.
// Реалізувати можливість обчислення відстані між двома точками.

// Біліотека повинна також містити класи Кольорова точка (з властивістю колір), який наслідує клас Точка.
// Реалізувати передачу параметрів по ієрархії наслідування при створенні об’єкта даного класу з використанням
// методів-конструкторів.
// Розробити невелику програму, яка використовує класи із даної dll-біліотеки.

var Point = function(x1,y1,z1) {
    this.x1 = x1;
    this.y1 = y1;
    this.z1 = z1;
    this.x2 = +prompt("vedit x2:");
    this.y2 = +prompt("vedit y2:");
    this.z2 = +prompt("vedit z2:");
};

var myPoint = new Point(0,0,0);
//AB = √(x2 - x1)2 + (y2 - y1)2 + (z2 - z1)2
myPoint.AB = Math.sqrt
(Math.pow(myPoint.x2-myPoint.x1,2)+
    (Math.pow(myPoint.y2-myPoint.y1,2))+
    (Math.pow(myPoint.z2-myPoint.z1,2)));

console.log(myPoint);
alert("відстань між двома точками: " + myPoint.AB);


var myColor = new Point(1,2,3);
myColor.color = prompt("add property color:");
console.log(myColor);
console.log(myColor.color);